questions = [
    {
        'текст вопроса': 'Какой из этих типов данных изменяемый?',
        'варианты ответов': ['tuple', 'list', 'str', 'int'],
        'индекс верного ответа': 1
    },
    {
        'текст вопроса': 'Какой оператор умножает цифры?',
        'варианты ответов': ['*', '**', 'x', '×'],
        'индекс верного ответа': 0
    },
    {
        'текст вопроса': 'Какой оператор останавливает цикл?',
        'варианты ответов': ['stop', 'block', 'Циклы в питоне остановить нельзя', 'break'],
        'индекс верного ответа': 3
    }
]
