questions = [
    {
        'текст вопроса': 'Какой из этих типов данных изменяемый?',
        'варианты ответов': ['tuple', 'list', 'str', 'int'],
        'индекс верного ответа': 1
    },
    {
        'текст вопроса': 'Какой оператор умножает цифры?',
        'варианты ответов': ['*', '**', 'x', '×'],
        'индекс верного ответа': 0
    },
    {
        'текст вопроса': 'Какой оператор останавливает цикл?',
        'варианты ответов': ['stop', 'block', 'Циклы в питоне остановить нельзя', 'break'],
        'индекс верного ответа': 3
    },
    {
        'текст вопроса': 'Какой cтиль программирования существует?',
        'варианты ответов': ['в ython нет стилей программирования', 'деконструктивный', 'ООП', 'проффисиональный'],
        'индекс верного ответа': 2
    },
    {
        'текст вопроса': 'Что такое "//" в ython?',
        'варианты ответов': ['оператор', 'операнд', 'метод', 'функция'],
        'индекс верного ответа': 0
    },
    {
        'текст вопроса': 'Какое сделать условие цикла while для бесконечного цикла?',
        'варианты ответов': ['∞', 'False', 'таких циклов нет', 'True'],
        'индекс верного ответа': 0
    },
    {
        'текст вопроса': 'С каким типом в python нельзя сделать абсолютно ничего?',
        'варианты ответов': ['None', 'int', 'str', 'tuple'],
        'индекс верного ответа': 0
    },
    {
        'текст вопроса': 'Какой оператор запускает цикл заново?',
        'варианты ответов': ['return', 'break', 'continue', 'нет правильного ответа'],
        'индекс верного ответа': 2
    },
    {
        'текст вопроса': 'Каки символом можно оставлять коментарии?',
        'варианты ответов': ['^', '&', '№', '#'],
        'индекс верного ответа': 3
    },
    {
        'текст вопроса': 'В какой библиотеке есть метод randint?',
        'варианты ответов': ['turtle', 'random', 'tkinter', 'pandas'],
        'индекс верного ответа': 2
    }
    
]
