questions = [
    {
        'текст вопроса': 'Какой из этих типов данных изменяемый?',
        'варианты ответов': [
            'tuple',
            'list',
            'str',
            'int'
            ],
        'верный ответ': 'list',
        'картинка': '01.png'
    },
    {
        'текст вопроса': 'Какой оператор умножает цифры?',
        'варианты ответов': [
            '*',
            '**',
            'x',
            '×'
            ],
        'верный ответ': '*'
    },
    {
        'текст вопроса': 'Какой оператор останавливает цикл?',
        'варианты ответов': [
            'stop',
            'block',
            'Циклы в питоне остановить нельзя',
            'break'
            ],
        'верный ответ': 'break'
    },
    {
        'текст вопроса': 'Какой cтиль программирования существует?',
        'варианты ответов': [
            'проффисиональный',
            'деконструктивный',
            'ООП',
            'конструктивный'
            ],
        'верный ответ': 'ООП'
    },
    {
        'текст вопроса': 'Что такое "//" в ython?',
        'варианты ответов': [
            'оператор',
            'операнд',
            'метод',
            'функция'
            ],
        'верный ответ': 'оператор'
    },
    {
        'текст вопроса':
        'Какое сделать условие цикла while для бесконечного цикла?',
        'варианты ответов': [
            '∞',
            'False',
            'таких циклов нет',
            'True'
            ],
        'верный ответ': 'True'
    },
    {
        'текст вопроса':
        'С каким типом в python нельзя сделать абсолютно ничего?',
        'варианты ответов': [
            'None',
            'int',
            'str',
            'tuple'
            ],
        'верный ответ': 'None'
    },
    {
        'текст вопроса': 'Какой оператор запускает цикл заново?',
        'варианты ответов': [
            'return',
            'break',
            'continue',
            'нет правильного ответа'
            ],
        'верный ответ': 'continue'
    },
    {
        'текст вопроса': 'Каки символом можно оставлять коментарии?',
        'варианты ответов': [
            '^',
            '&',
            '№',
            '#'
            ],
        'верный ответ': '#'
    },
    {
        'текст вопроса': 'В какой библиотеке есть метод randint?',
        'варианты ответов': [
            'turtle',
            'random',
            'tkinter',
            'pandas'
            ],
        'верный ответ': 'random'
    }

]
